---
kind: type
id: T:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions
source: html/18297392-d94a-cdab-feb3-81482771c44d.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelOptions

Options that govern the calculations for the generation of the energy analysis detail model.

## Syntax (C#)
```csharp
public class EnergyAnalysisDetailModelOptions : IDisposable
```